# Parameters
nc: 5
ch: 4
scales:
  n: [0.33, 0.25, 1024]

# -------------------------------------------------------------
# Backbone: 双分支并行 + YOLO11 核心架构
# -------------------------------------------------------------
backbone:
  # === 0. 缓存原始输入图 (非常关键) ===
  - [-1, 1, PassThrough, []]          # 0 - 缓存 4 通道原图

  # === 1. 早期处理与分流 ===
  # 从原图(0)提取干净的 RGB 素材特征
  - [0, 1, RGB_Extract, [64]]         # 1 - RGB_Clean_Stem

  # 从原图(0)提取稳定的 IR 基础特征
  - [0, 1, IR_Extract, [64]]          # 2 - IR_Stem

  # 早期残差融合: Main_Stem = IR_Stem(2) + RGB_Clean_Stem(1)
  - [[2, 1], 1, Feature_Add, [64]]    # 3 - Main_Stem

  # === 2. 主干网络 (Main Stream) ===
  - [3, 1, Conv, [128, 3, 2]]         # 4 - P2/4
  - [-1, 2, C3k2, [128, True]]        # 5
  - [-1, 1, Conv, [256, 3, 2]]        # 6 - P3/8
  - [-1, 2, C3k2, [256, True]]        # 7 (Main_P3 - FPN第一层输入)
  - [-1, 1, Conv, [512, 3, 2]]        # 8 - P4/16
  - [-1, 2, C3k2, [512, True]]        # 9 (Main_P4 - 待融合)
  - [-1, 1, Conv, [1024, 3, 2]]       # 10 - P5/32
  - [-1, 2, C3k2, [1024, True]]       # 11
  - [-1, 1, SPPF, [1024, 5]]          # 12
  - [-1, 2, C2PSA, [1024]]            # 13 (Main_P5)

  # === 3. 干净 RGB 特征素材池并行下采样 ===
  # 注意：必须从 RGB_Clean_Stem (索引 1) 开始独立下采样！
  - [1, 1, Conv, [128, 3, 2]]         # 14 - RGB_P2
  - [-1, 1, Conv, [256, 3, 2]]        # 15 - RGB_P3
  - [-1, 1, C3k2, [256, False]]       # 16 - 提炼
  - [-1, 1, Conv, [512, 3, 2]]        # 17 - RGB_P4 (对齐 Main_P4，索引 9)
  - [-1, 1, Conv, [1024, 3, 2]]       # 18 - RGB_P5_raw
  - [-1, 1, C3k2, [1024, False]]      # 19 - RGB_P5 (对齐 Main_P5，索引 13)

# -------------------------------------------------------------
# Neck & Head: 跨模态 Transformer + YOLO11 FPN + OBB
# -------------------------------------------------------------
head:
  # === 1. 深层 Cross-Modal Transformer 注入 ===
  - [[9, 17], 1, Cross_Modal_Attention, [512]]   # 20 - Enhanced_P4
  - [[13, 19], 1, Cross_Modal_Attention, [1024]] # 21 - Enhanced_P5

  # === 2. YOLO11 标准 PANet 架构 ===
  # Top-down
  - [21, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 20], 1, Concat, [1]]  # 23 - 连接 Enhanced_P4
  - [-1, 2, C3k2, [512, False]] # 24

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]   # 26 - 连接 Main_P3 (索引 7)
  - [-1, 2, C3k2, [256, False]] # 27 (Neck 输出层 P3)

  # Bottom-up
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 24], 1, Concat, [1]]  # 29
  - [-1, 2, C3k2, [512, False]] # 30 (Neck 输出层 P4)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 21], 1, Concat, [1]]  # 32
  - [-1, 2, C3k2, [1024, False]]# 33 (Neck 输出层 P5)

  # === 3. 旋转目标检测头 (OBB) ===
  - [[27, 30, 33], 1, OBB, [nc, 1]]  # 34 - OBB Detect