# Ultralytics YOLO 🚀, AGPL-3.0 license
# 面向全天候无人机场景的 4 通道 RGBT 双流小目标检测架构

nc: 5  # 你的目标类别数
ch: 4
scales:
  n: [0.33, 0.25, 1024]

# -------------------------------------------------------------
# [from, repeats, module, args]
backbone:
  # 0: 保存 DataLoader 传进来的 4 通道输入 (BGR:3 + IR:1)
  - [-1, 1, nn.Identity, []]

  # ============ 1. 可见光 (RGB) 分支 ============
  - [0, 1, ConvSplitRGB, [64, 3, 2]]    # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 2-P2/4
  - [-1, 3, C2f, [128, True]]           # 3
  - [-1, 1, Conv, [256, 3, 2]]          # 4-P3/8
  - [-1, 6, C2f, [256, True]]           # 5  <-- RGB P3 特征
  - [-1, 1, Conv, [512, 3, 2]]          # 6-P4/16
  - [-1, 6, C2f, [512, True]]           # 7  <-- RGB P4 特征
  - [-1, 1, Conv, [1024, 3, 2]]         # 8-P5/32
  - [-1, 3, C2f, [1024, True]]          # 9
  - [-1, 1, SPPF, [1024, 5]]            # 10 <-- RGB P5 特征

  # ============ 2. 热成像 (Thermal) 分支 ============
  - [0, 1, ConvSplitThermal, [64, 3, 2]] # 11-P1/2 (时光倒流回第 0 层拿数据)
  - [-1, 1, Conv, [128, 3, 2]]           # 12-P2/4
  - [-1, 3, C2f, [128, True]]            # 13
  - [-1, 1, Conv, [256, 3, 2]]           # 14-P3/8
  - [-1, 6, C2f, [256, True]]            # 15 <-- Thermal P3 特征
  - [-1, 1, Conv, [512, 3, 2]]           # 16-P4/16
  - [-1, 6, C2f, [512, True]]            # 17 <-- Thermal P4 特征
  - [-1, 1, Conv, [1024, 3, 2]]          # 18-P5/32
  - [-1, 3, C2f, [1024, True]]           # 19
  - [-1, 1, SPPF, [1024, 5]]             # 20 <-- Thermal P5 特征

  # ============ 3. 跨模态 CBAM 注意力特征融合 ============
  # 注意：这里调用的是 CrossModalFusion，请确保你在 tasks.py 注册的名字一致
  # 如果你用的是我刚才给你的 Feature_CM_CBAM，记得把这里的名字改成 Feature_CM_CBAM
  - [[5, 15], 1, CrossModalFusion, []]   # 21: 融合 P3 (小目标检测核心) -> 输出 256
  - [[7, 17], 1, CrossModalFusion, []]   # 22: 融合 P4 -> 输出 512
  - [[10, 20], 1, CrossModalFusion, []]  # 23: 融合 P5 -> 输出 1024

# -------------------------------------------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 24: P5 上采样
  - [[-1, 22], 1, Concat, [1]]                 # 25: 拼接融合后的 P4

  # 🌟 创新点：引入空洞卷积特征金字塔，利用上下文抑制热点误检
  - [-1, 3, DilatedC2f, [512, False]]          # 26: 替换原版 C2f

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 27: P4 上采样
  - [[-1, 21], 1, Concat, [1]]                 # 28: 拼接融合后的 P3 (小目标防线)

  # 🌟 创新点：小目标层再次进行空洞卷积提纯
  - [-1, 3, DilatedC2f, [256, False]]          # 29: 替换原版 C2f

  # 下采样路径
  - [-1, 1, Conv, [256, 3, 2]]                 # 30
  - [[-1, 26], 1, Concat, [1]]                 # 31
  - [-1, 3, C2f, [512, False]]                 # 32

  - [-1, 1, Conv, [512, 3, 2]]                 # 33
  - [[-1, 23], 1, Concat, [1]]                 # 34
  - [-1, 3, C2f, [1024, False]]                # 35

  # 将提纯后的 P3(29层), P4(32层), P5(35层) 送入检测头
  - [[29, 32, 35], 1, Detect, [nc]]            # 36